app/views/lesson_mailer/send_lesson_confirmation.html.erb

SELECT "students".* FROM "students" WHERE "students"."lesson_id" = $1  [["lesson_id", 3]]
---
      <li>Instructor: <%= @lesson.instructor.username %></li>
      <li>Students: <%= @lesson.students.map(&:name).join(', ') %></li>