app/controllers/beta_users_controller.rb

  def index
    @beta_users = BetaUser.all
---
SELECT "beta_users".* FROM "beta_users"

  def create
    @beta_user = BetaUser.new(beta_user_params)

    respond_to do |format|
      if @beta_user.save
---
INSERT INTO "beta_users" ("created_at", "email", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 06 Jul 2016 06:59:20 UTC +00:00], ["email", "bbensch@gmail.com"], ["updated_at", Wed, 06 Jul 2016 06:59:20 UTC +00:00]]

    def set_beta_user
      @beta_user = BetaUser.find(params[:id])
---
SELECT "beta_users".* FROM "beta_users" WHERE "beta_users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1