app/controllers/lessons_controller.rb

  def complete
    @lesson = Lesson.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", "3"]]

  def edit
    @lesson = Lesson.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    @lesson = Lesson.find(params[:id])
    @original_lesson = @lesson.dup
    @lesson.assign_attributes(lesson_params)
    @lesson.lesson_time = @lesson_time = LessonTime.find_or_create_by(lesson_time_params)
    if @lesson.save
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "lessons" SET "state" = $1, "gear" = $2, "objectives" = $3, "duration" = $4, "start_time" = $5, "experience_level" = $6, "terms_accepted" = $7, "updated_at" = $8 WHERE "lessons"."id" = 1

  def show
    @lesson = Lesson.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", "1"]]

  def destroy
    @lesson = Lesson.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE (lesson_time_id = 1 AND instructor_id is not null)

  def set_instructor
    @lesson = Lesson.find(params[:id])
    @lesson.instructor_id = current_user.instructor.id
    @lesson.update(state: 'confirmed')
---
SELECT "lessons".* FROM "lessons" WHERE (lesson_time_id = 1 AND instructor_id is not null)
UPDATE "lessons" SET "instructor_id" = $1, "state" = $2, "updated_at" = $3 WHERE "lessons"."id" = 3  [["instructor_id", 2], ["state", "confirmed"], ["updated_at", Fri, 08 Jul 2016 18:28:49 UTC +00:00]]